MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K90/mcu.h
extern volatile PORTGbits_t PORTGbits __at(0xF86);
// bitfield macros
#define _PORTG_RG0_POSN                                     0x0
#define _PORTG_RG0_POSITION                                 0x0
#define _PORTG_RG0_SIZE                                     0x1
#define _PORTG_RG0_LENGTH                                   0x1
#define _PORTG_RG0_MASK                                     0x1
#define _PORTG_RG1_POSN                                     0x1
#define _PORTG_RG1_POSITION                                 0x1
#define _PORTG_RG1_SIZE                                     0x1
#define _PORTG_RG1_LENGTH                                   0x1
#define _PORTG_RG1_MASK                                     0x2
#define _PORTG_RG2_POSN                                     0x2
#define _PORTG_RG2_POSITION                                 0x2
#define _PORTG_RG2_SIZE                                     0x1
#define _PORTG_RG2_LENGTH                                   0x1
#define _PORTG_RG2_MASK                                     0x4
#define _PORTG_RG3_POSN                                     0x3
#define _PORTG_RG3_POSITION                                 0x3
#define _PORTG_RG3_SIZE                                     0x1
#define _PORTG_RG3_LENGTH                                   0x1
#define _PORTG_RG3_MASK                                     0x8
#define _PORTG_RG4_POSN                                     0x4
#define _PORTG_RG4_POSITION                                 0x4
#define _PORTG_RG4_SIZE                                     0x1
#define _PORTG_RG4_LENGTH                                   0x1
#define _PORTG_RG4_MASK                                     0x10
#define _PORTG_RG5_POSN                                     0x5
#define _PORTG_RG5_POSITION                                 0x5
#define _PORTG_RG5_SIZE                                     0x1
#define _PORTG_RG5_LENGTH                                   0x1
#define _PORTG_RG5_MASK                                     0x20
#define _PORTG_CCP3_POSN                                    0x0
#define _PORTG_CCP3_POSITION                                0x0
#define _PORTG_CCP3_SIZE                                    0x1
#define _PORTG_CCP3_LENGTH                                  0x1
#define _PORTG_CCP3_MASK                                    0x1
#define _PORTG_C3OUT_POSN                                   0x1
#define _PORTG_C3OUT_POSITION                               0x1
#define _PORTG_C3OUT_SIZE                                   0x1
#define _PORTG_C3OUT_LENGTH                                 0x1
#define _PORTG_C3OUT_MASK                                   0x2
#define _PORTG_C3INA_POSN                                   0x2
#define _PORTG_C3INA_POSITION                               0x2
#define _PORTG_C3INA_SIZE                                   0x1
#define _PORTG_C3INA_LENGTH                                 0x1
#define _PORTG_C3INA_MASK                                   0x4
#define _PORTG_C3INB_POSN                                   0x3
#define _PORTG_C3INB_POSITION                               0x3
#define _PORTG_C3INB_SIZE                                   0x1
#define _PORTG_C3INB_LENGTH                                 0x1
#define _PORTG_C3INB_MASK                                   0x8
#define _PORTG_C3INC_POSN                                   0x4
#define _PORTG_C3INC_POSITION                               0x4
#define _PORTG_C3INC_SIZE                                   0x1
#define _PORTG_C3INC_LENGTH                                 0x1
#define _PORTG_C3INC_MASK                                   0x10
#define _PORTG_PA3_POSN                                     0x0
#define _PORTG_PA3_POSITION                                 0x0
#define _PORTG_PA3_SIZE                                     0x1
#define _PORTG_PA3_LENGTH                                   0x1
#define _PORTG_PA3_MASK                                     0x1
#define _PORTG_TX2_POSN                                     0x1
#define _PORTG_TX2_POSITION                                 0x1
#define _PORTG_TX2_SIZE                                     0x1
#define _PORTG_TX2_LENGTH                                   0x1
#define _PORTG_TX2_MASK                                     0x2
#define _PORTG_RX2_POSN                                     0x2
#define _PORTG_RX2_POSITION                                 0x2
#define _PORTG_RX2_SIZE                                     0x1
#define _PORTG_RX2_LENGTH                                   0x1
#define _PORTG_RX2_MASK                                     0x4
#define _PORTG_PD3_POSN                                     0x3
#define _PORTG_PD3_POSITION                                 0x3
#define _PORTG_PD3_SIZE                                     0x1
#define _PORTG_PD3_LENGTH                                   0x1
#define _PORTG_PD3_MASK                                     0x8
#define _PORTG_PD1_POSN                                     0x4
#define _PORTG_PD1_POSITION                                 0x4
#define _PORTG_PD1_SIZE                                     0x1
#define _PORTG_PD1_LENGTH                                   0x1
#define _PORTG_PD1_MASK                                     0x10
#define _PORTG_AN19_POSN                                    0x1
#define _PORTG_AN19_POSITION                                0x1
#define _PORTG_AN19_SIZE                                    0x1
#define _PORTG_AN19_LENGTH                                  0x1
#define _PORTG_AN19_MASK                                    0x2
#define _PORTG_AN18_POSN                                    0x2
#define _PORTG_AN18_POSITION                                0x2
#define _PORTG_AN18_SIZE                                    0x1
#define _PORTG_AN18_LENGTH                                  0x1
#define _PORTG_AN18_MASK                                    0x4
#define _PORTG_AN17_POSN                                    0x3
#define _PORTG_AN17_POSITION                                0x3
#define _PORTG_AN17_SIZE                                    0x1
#define _PORTG_AN17_LENGTH                                  0x1
#define _PORTG_AN17_MASK                                    0x8
#define _PORTG_AN16_POSN                                    0x4
#define _PORTG_AN16_POSITION                                0x4
#define _PORTG_AN16_SIZE                                    0x1
#define _PORTG_AN16_LENGTH                                  0x1
#define _PORTG_AN16_MASK                                    0x10
#define _PORTG_CK2_POSN                                     0x1
#define _PORTG_CK2_POSITION                                 0x1
#define _PORTG_CK2_SIZE                                     0x1
#define _PORTG_CK2_LENGTH                                   0x1
#define _PORTG_CK2_MASK                                     0x2
#define _PORTG_DT2_POSN                                     0x2
#define _PORTG_DT2_POSITION                                 0x2
#define _PORTG_DT2_SIZE                                     0x1
#define _PORTG_DT2_LENGTH                                   0x1
#define _PORTG_DT2_MASK                                     0x4
#define _PORTG_CCP4_POSN                                    0x3
#define _PORTG_CCP4_POSITION                                0x3
#define _PORTG_CCP4_SIZE                                    0x1
#define _PORTG_CCP4_LENGTH                                  0x1
#define _PORTG_CCP4_MASK                                    0x8
#define _PORTG_CCP5_POSN                                    0x4
#define _PORTG_CCP5_POSITION                                0x4
#define _PORTG_CCP5_SIZE                                    0x1
#define _PORTG_CCP5_LENGTH                                  0x1
#define _PORTG_CCP5_MASK                                    0x10
#define _PORTG_SEG26_POSN                                   0x4
#define _PORTG_SEG26_POSITION                               0x4
#define _PORTG_SEG26_SIZE                                   0x1
#define _PORTG_SEG26_LENGTH                                 0x1
#define _PORTG_SEG26_MASK                                   0x10
#define _PORTG_T7CKI_POSN                                   0x4
#define _PORTG_T7CKI_POSITION                               0x4
#define _PORTG_T7CKI_SIZE                                   0x1
#define _PORTG_T7CKI_LENGTH                                 0x1
#define _PORTG_T7CKI_MASK                                   0x10
#define _PORTG_T5G_POSN                                     0x4
#define _PORTG_T5G_POSITION                                 0x4
#define _PORTG_T5G_SIZE                                     0x1
#define _PORTG_T5G_LENGTH                                   0x1
#define _PORTG_T5G_MASK                                     0x10
#define _PORTG_RTCC_POSN                                    0x4
#define _PORTG_RTCC_POSITION                                0x4
#define _PORTG_RTCC_SIZE                                    0x1
#define _PORTG_RTCC_LENGTH                                  0x1
#define _PORTG_RTCC_MASK                                    0x10
#define _PORTG_C3OUTG_POSN                                  0x1
#define _PORTG_C3OUTG_POSITION                              0x1
#define _PORTG_C3OUTG_SIZE                                  0x1
#define _PORTG_C3OUTG_LENGTH                                0x1
#define _PORTG_C3OUTG_MASK                                  0x2
#define _PORTG_RJPU_POSN                                    0x5
#define _PORTG_RJPU_POSITION                                0x5
#define _PORTG_RJPU_SIZE                                    0x1
#define _PORTG_RJPU_LENGTH                                  0x1
#define _PORTG_RJPU_MASK                                    0x20

